#ifndef _GAME_HMFMAN_H
#define _GAME_HMFMAN_H

#include "ultra64.h"
#include "marioparty.h"

#define HU3D_MODEL_MAX 128

typedef struct {
    Gfx* unk00[4];
    void* unk10;
    void* unk14;
} mp3_HmfModelData_Unk64_Unk3C_Struct;

typedef struct {
    u8 unk00;
    char unk01[0x33];
} mp3_HmfModelData_Unk64_Unk60_Unk54_Struct;

typedef struct {
    char unk00[0x22];
    s16 unk22;
    char unk24[4];
    s16 unk28;
    s16 unk2A;
    char unk2C[0x24];
    s32 unk50;
    mp3_HmfModelData_Unk64_Unk60_Unk54_Struct* unk54;
    char unk58[0x10];
} mp3_HmfModelData_Unk64_Unk60_Struct;

typedef struct {
    char unk00[0x18];
} mp3_HmfModelData_Unk64_Unk8C_Struct;

typedef struct {
    char unk00[2];
    s16 unk02;
    char unk04[4];
    s32 unk08;
} mp3_HmfModelData_Unk64_Unk98_Struct;

typedef struct {
    char unk_00[0x30];
    s32 unk_30;
} mp3_HmfData_Unk84_Entry2;

// New struct for the array at unk84 (0x10 bytes per entry)
typedef struct {
    u8 unk0[3];
    u8 unk3;
    u8 unk4;
    u8 unk5[4];
    u8 unk9;
    u8 unkA[2];
    mp3_HmfData_Unk84_Entry2* unkC;  // Pointer to something with unk30 field
} mp3_HmfData_Unk84_Entry;

typedef struct {
    u8 unk00;
    s8 unk01;
    char unk02[8];
    u8 unk0A;
    s8 unk0B;
    s8 unk0C;
    s16 unk0E;
    s16 unk10;
    s16 unk12;  // Changed from char[2] since it's used as s16
    s16 unk14;
    char unk16[0x22];
    s32 unk38;
    mp3_HmfModelData_Unk64_Unk3C_Struct* unk3C;
    void* unk40;
    Vtx* unk44[3];
    void* unk50;
    char unk54[0xC];
    mp3_HmfModelData_Unk64_Unk60_Struct* unk60;
    char unk64[0x20];
    mp3_HmfData_Unk84_Entry* unk84;  // Array of entries
    char unk88[4];
    mp3_HmfModelData_Unk64_Unk8C_Struct* unk8C;
    mp3_HmfModelData_Unk64_Unk8C_Struct* unk90;
    mp3_HmfModelData_Unk64_Unk8C_Struct* unk94;
    mp3_HmfModelData_Unk64_Unk98_Struct* unk98;
    char unk9C[4];
    s32 unkA0;
    f32 unkA4;
    f32 unkA8;
    f32 unkAC;
    char unkB0[4];
    s32 unkB4;
    char unkB8[0x10];
    s32 unkC8;
    char unkCC[4];
    s32 unkD0;
    char unkD4[8];
} mp3_HmfData;

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ char unk02[2];
    /* 0x04 */ u16 unk04;
    /* 0x08 */ char unk08[0x10];
    /* 0x18 */ void (*unk18)(s16);
} mp3_HmfModelData_UnkBC_Struct; // Size unknown

typedef struct {
    /* 0x00 */ s8 unk00;
    /* 0x01 */ u8 unk01;
    /* 0x02 */ u8 unk02;
    /* 0x03 */ u8 unk03;
    /* 0x04 */ u8 unk04;
    /* 0x05 */ u8 unk05;
    /* 0x06 */ u8 unk06;
    /* 0x07 */ s8 unk07;
    /* 0x08 */ u8 unk08;
    /* 0x09 */ u8 unk09;
    /* 0x0A */ u8 unk0A;
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ char unk12[6];
    /* 0x18 */ s32 unk18;
    /* 0x1C */ Vec pos;
    /* 0x28 */ Vec rot;
    /* 0x34 */ Vec scale;
    /* 0x40 */ f32 unk40;
    /* 0x44 */ f32 unk44;
    /* 0x48 */ f32 unk48;
    /* 0x4C */ f32 unk4C;
    /* 0x50 */ f32 unk50;
    /* 0x54 */ f32 unk54;
    /* 0x58 */ f32 unk58;
    /* 0x5C */ f32 unk5C;
    /* 0x60 */ f32 unk60;
    /* 0x64 */ mp3_HmfData* hmf;
    /* 0x68 */ char unk68[8]; // 68 => 60 has size 0x68
    /* 0x70 */ void (*unk70)(Gfx**, s32, s32);
    /* 0x74 */ f32 mtx[16];
    /* 0xB4 */ s32 unkB4;
    /* 0xB8 */ char unkB8[4];
    /* 0xBC */ mp3_HmfModelData_UnkBC_Struct* unkBC;
} mp3_HmfModel; // Size 0xC0

void mp3_func_8001A070_1AC70(void* arg0, void* arg1, u16 arg2, u16 arg3, u16 arg4, u8 arg5);
s16 mp3_Hu3DModelCreate(u8*, u32);
s16 mp3_Hu3DModelLink(s16 linkMdlId);
s32 mp3_func_8001A894_1B494(s32, void*, s32); // unsure about second arg. Gfx*?
s16 mp3_func_8001AC8C_1B88C(s32 arg0, void (*arg1)(Gfx**, s32, s32), u8 arg2);
void mp3_func_8001ACDC_1B8DC(s16);
void mp3_func_8001B0B4_1BCB4(void** arg0, u32 arg1);
void mp3_func_8001BF90_1CB90(u32 arg0, u32 arg1);
void mp3_Hu3DModelPosSet(s16 arg0, f32 x, f32 y, f32 z);
void mp3_Hu3DModelRotSet(s16 arg0, f32 x, f32 y, f32 z);
void mp3_Hu3DModelScaleSet(s16 arg0, f32 x, f32 y, f32 z);
void mp3_func_8001C258_1CE58(s16 arg0, s32 arg1, s32 arg2);
void mp3_func_8001C2FC_1CEFC(s16 arg0, s32 arg1, s32 arg2);
void mp3_func_8001C448_1D048(s16);
s32 mp3_func_8001C514_1D114(s32);
void mp3_func_8001C5B4_1D1B4(s16, s16);
void mp3_func_8001C624_1D224(s16, s16, s16, s16, s32);
void mp3_func_8001C6A8_1D2A8(s32, f32);
f32 mp3_func_8001C7D0_1D3D0(s16 arg0);
void mp3_func_8001C814_1D414(s16, s16, s16);
void mp3_func_8001C8A8_1D4A8(s16, s16);
void mp3_func_8001C8E4_1D4E4(s16, u32);
void mp3_func_8001C92C_1D52C(s16, f32);
s32 mp3_func_8001C954_1D554(s32);
void mp3_func_8001EF24_1FB24(s32, s32, s32, s32, s32);
s32 mp3_func_8001F1FC_1FDFC(void*, s32);
void mp3_func_8001F304_1FF04(s16, s16);
void mp3_func_8001F38C_1FF8C(s32, s32, s32);
void mp3_func_8001FDE8_209E8(s16);

extern mp3_HmfModel* mp3_HmfModelData;

#endif
